import { TLesson } from "../types";

export const LESSONS: Array<TLesson> = [
  {
    title: "Job Search Strategies",
    details: {
      whatLearn: [
        "Определим карьерную цель и подберем стратегию на основе анализа",
        "Используем инструменты для планирования пути к офферу",
        "Напишем универсальное сопроводительное",
        "Разберем ошибки при написании достижений",
      ],
      extraNote: "Дополнительно: Ревью CV на тарифах «Guidance» и «Premium»",
    },
  },
  {
    title: "Preparing for the Initial Conversation",
    details: {
      whatLearn: [
        "Разберем, как проходят скрининговые интервью",
        "Научимся искусству  small talk",
        "Подготовим самопрезентацию",
        "Ответим на популярные вопросы от HR",
      ],
    },
  },
  {
    title: "Company values",
    details: {
      whatLearn: [
        "Поговорим о ценностях компаний",
        "Выберем подходящий контент для ответов на поведенческие вопросы",
        "Используем фреймворки для структурирования историй",
        "Потренируемся рассказывать истории",
      ],
    },
  },
  {
    title: "Teamwork",
    details: {
      whatLearn: [
        "Раскроем критерии, на которые обращают внимание интервьюеры",
        "Найдем подходящий кейс для рассказа о фейлах и конфликтах",
        "Сделаем ответ менее эмоциональным и более профессиональным",
        "Поделимся опытом на практике",
      ],
    },
  },
  {
    title: "Tricky behavioral questions",
    details: {
      whatLearn: [
        "Обсудим, как поведенческие вопросы маскируют под технические",
        "Соотнесем историю с ценностями компании",
        "Подчеркнем навыки работы в команде",
        "Отработаем сложные вопросы",
      ],
    },
  },
  {
    title: "Reviewing Common Interview Mistakes",
    details: {
      whatLearn: [
        "Разберем частые ошибки на технических собеседованиях",
        "Научимся планировать и распределять время ответа",
        "Отработаем вопросы технических собеседований в парах",
      ],
    },
  },
  {
    title: "Mock Interview",
    details: {
      whatLearn: [
        "Проведем пробное собеседование по всем вопросам курса",
      ],
    },
  },
];
